Can't change an imported or linked element's symbol type.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotChangeImportSymbol { get; }
  Visual Basic
Public Shared ReadOnly Property CannotChangeImportSymbol As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotChangeImportSymbol {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures ImportFailures Class
  Autodesk.Revit.DB Namespace